tap "auth0/auth0-cli"
tap "charmbracelet/tap"
tap "cloudflare/cloudflare"
tap "electrikmilk/cherri"
tap "hashicorp/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "raisedadead/tap"
tap "supabase/tap"
# GNU multiple precision arithmetic library
brew "gmp"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Simple, modern, secure file encryption
brew "age"
# Generic-purpose lossless compression algorithm by Google
brew "brotli"
# Extremely Fast Compression algorithm
brew "lz4"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Macro processing language
brew "m4"
# Automatic configure script builder
brew "autoconf"
# Collection of over 500 reusable autoconf macros
brew "autoconf-archive"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Nuke a whole AWS account and delete all its resources
brew "aws-nuke"
# C string library for manipulating Unicode strings
brew "libunistring"
# Text-based UI library
brew "ncurses"
# Library for command-line editing
brew "readline"
# Mozilla CA certificate store
brew "ca-certificates"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Memory upgrade for your coding agent
brew "beads"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Asynchronous DNS library
brew "c-ares"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# X.Org: Protocol Headers
brew "xorgproto"
# X.Org: A Sample Authorization Protocol for X
brew "libxau"
# X.Org: X Display Manager Control Protocol library
brew "libxdmcp"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# X.Org: Core X11 protocol client library
brew "libx11"
# X.Org: Library for common extensions to the X11 protocol
brew "libxext"
# Object-file caching compiler wrapper
brew "ccache"
# Mozilla CA bundle for Python
brew "certifi"
# Cut, copy, and paste anything, anywhere, all from the terminal
brew "clipboard"
# HTTP/2 C Library
brew "libnghttp2"
# Command-line interface for SQLite
brew "sqlite"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# Command-line tool for DigitalOcean
brew "doctl"
# Command-line DNS Client for Humans
brew "doggo"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# CLI application for interacting with a Cloudflare account
brew "flarectl"
# Fast and simple Node.js version manager
brew "fnm"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Library for decimal floating point arithmetic
brew "mpdecimal"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Render markdown on the CLI
brew "glow"
# Asynchronous event library
brew "libevent"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Low-level cryptographic library
brew "nettle"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Common error values for all GnuPG components
brew "libgpg-error"
# Assuan IPC Library
brew "libassuan"
# Cryptographic library based on the code from GnuPG
brew "libgcrypt"
# X.509 and CMS library
brew "libksba"
# Library for USB device access
brew "libusb"
# New GNU portable threads library
brew "npth"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser"
# Make JSON greppable
brew "gron"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Git dotfiles synchronizer written in bash
brew "homeshick"
# Curl statistics made simple
brew "httpstat"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Interactive JSON filter using jq
brew "jnv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Simple terminal UI for git commands
brew "lazygit"
# CBOR protocol implementation for C and others
brew "libcbor"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# X.Org: Header files for the XFIXES extension
brew "libxfixes"
# YAML Parser
brew "libyaml"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# CLI for the Linode API
brew "linode-cli"
# Access large language models from the command-line
brew "llm"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Mac App Store command-line interface
brew "mas"
# Run a Kubernetes cluster locally
brew "minikube"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client@8.0"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Perl compatible regular expressions library
brew "pcre"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Generic machine emulator and virtualizer
brew "qemu"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Safe, concurrent, practical language
brew "rust"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Incremental parsing library
brew "tree-sitter"
# Parser generator tool
brew "tree-sitter-cli"
# Minimal terminal-based typing speed tester
brew "typtea"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# C++ Library Manager
brew "vcpkg"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Lookup tool for domain names and other internet resources
brew "whois"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Linter for YAML files
brew "yamllint"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Siri Shortcuts programming language
brew "electrikmilk/cherri/cherri"
# Terraform
brew "hashicorp/tap/terraform"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Supabase CLI
brew "supabase/tap/supabase"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Image editing and design software
cask "affinity"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Display management tool
cask "betterdisplay"
# Web browser focusing on privacy
cask "brave-browser"
# Screen recording software
cask "cap"
# Anthropic's official Claude AI desktop app
cask "claude"
# Write, edit, and chat about your code with AI
cask "cursor"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Open-source cross-platform alternative to AirDrop
cask "localsend"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# VPN client
cask "mullvad-vpn"
# Replacement for Docker Desktop
cask "orbstack"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Window snapping tool
cask "rectangle-pro"
# Screenshot measurement and annotation tool
cask "shottr"
# Sound and audio controller
cask "soundsource"
# App launcher/switcher
cask "spacelauncher"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Git worktree manager with bare repo support
cask "raisedadead/tap/wt"
mas "1Password for Safari", id: 1569813296
mas "Command X", id: 6448461551
mas "Cursor Pro", id: 1447043133
mas "Dato", id: 1470584107
mas "Day Progress", id: 6450280202
mas "Hyperduck", id: 6444667067
mas "Keystroke Pro", id: 1572206224
mas "Lungo", id: 1263070803
mas "Parcel", id: 375589283
mas "Structured", id: 1499198946
mas "Tot", id: 1491071483
mas "Unsplash Wallpapers", id: 1284863847
mas "Velja", id: 1607635845
mas "VN", id: 1494451650
vscode "1password.op-vscode"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "kamikillerto.vscode-colorize"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "mk12.better-git-line-blame"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mvllow.rose-pine"
vscode "redhat.vscode-yaml"
vscode "sourcegraph.sourcegraph"
vscode "steoates.autoimport"
vscode "tamasfe.even-better-toml"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "wakatime.vscode-wakatime"
vscode "wix.vscode-import-cost"
vscode "yatki.vscode-surround"
vscode "yy0931.save-as-root"
vscode "ziglang.vscode-zig"
go "golang.org/x/tools/gopls"
go "gotest.tools/gotestsum"
go "github.com/grafana/grafanactl/cmd/grafanactl"
go "github.com/kencx/keyb"
go "github.com/evilmartians/lefthook"
go "honnef.co/go/tools/cmd/staticcheck"
uv "specify-cli"
